RegiXResources/RegiXAdapters/NBDAdapter/PersonDataSearchRequest.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IRegiXEntryPoint/ExecuteSynchronous</a:Action>
    <a:MessageID>urn:uuid:b74443a6-f528-4b89-a76a-9d26fef8c5af</a:MessageID>
    <ActivityId CorrelationId="caa4260a-8316-4ef7-b91a-4d93f5750b7d" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">a2c5eb79-35b6-4e4b-a283-2e30cde05fb4</ActivityId>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <ExecuteSynchronous xmlns="http://tempuri.org/">
      <request>
        <Operation>TechnoLogica.RegiX.GraoNBDAdapter.APIService.INBDAPI.PersonDataSearch</Operation>
        <Argument>
          <PersonDataRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://egov.bg/RegiX/GRAO/NBD/PersonDataRequest">
            <EGN>8506258485</EGN>
          </PersonDataRequest>
        </Argument>
        <CallContext>
          <ServiceURI>132-11123-01.01.2016</ServiceURI>
          <ServiceType>За проверовъчна дейност</ServiceType>
          <EmployeeIdentifier>tl_ytoteva</EmployeeIdentifier>
          <EmployeeNames>Йорданка Тотева</EmployeeNames>
          <EmployeeAditionalIdentifier />
          <EmployeePosition>SW Developer</EmployeePosition>
          <AdministrationOId>2.16.100.1.1.1.1.15</AdministrationOId>
          <AdministrationName>Министерство на транспорта, информационните технологии и съобщенията</AdministrationName>
          <LawReason>За целите на разработката и тестването на RegiX.</LawReason>
          <Remark />
        </CallContext>
        <SignResult>true</SignResult>
        <ReturnAccessMatrix>true</ReturnAccessMatrix>
      </request>
    </ExecuteSynchronous>
  </s:Body>
</s:Envelope>